{
  "intents": [
    {
      "tag": "saludo",
      "patterns": ["hola", "que tal", "como estas", "saludos", "buenos dias"],
      "responses": [
        "Hola, ¿Cómo estás?",
        "¡Hola! ¿En qué puedo ayudarte hoy?",
        "¡Buenos días! ¿Cómo puedo asistirte?"
      ]
    },
    {
      "tag": "nombre",
      "patterns": ["cual es tu nombre", "como te llamas", "que eres", "quien eres"],
      "responses": [
        "Soy Alexa, tu asistente virtual de System For All.",
        "¡Hola! Soy Alexa, el chatbot de System For All. ¿En qué puedo ayudarte hoy?",
        "Mi nombre es Alexa, estoy aquí para ayudarte con cualquier pregunta."
      ]
    },
    {
      "tag": "gracias",
      "patterns": ["gracias", "bien", "genial", "perfecto", "gracias por la ayuda"],
      "responses": [
        "De nada, ¡siempre estoy aquí para ayudar!",
        "¡Genial! ¿Hay algo más en lo que pueda asistirte?",
        "¡Perfecto! Si necesitas más ayuda, no dudes en preguntar."
      ]
    },
    {
      "tag": "adios",
      "patterns": ["adios", "nos vemos", "hasta luego"],
      "responses": [
        "¡Adiós! Siempre estoy aquí cuando lo necesites.",
        "Hasta luego, ¡que tengas un gran día!",
        "Nos vemos pronto. ¡Gracias por la conversación!"
      ]
    },
    {
      "tag": "acerca_de_nosotros",
      "patterns": [
        "que es system for all",
        "para que sirve system for all",
        "cuentame algo acerca de system for all",
        "informacion sobre system for all",
        "informacion sobre la empresa",
        "acerca de la empresa",
        "acerca de system for all"
      ],
      "responses": [
        "System For All es tu socio confiable en soluciones de software innovadoras y personalizadas. Trabajamos para impulsar la eficiencia y el éxito de tu empresa a través de tecnología avanzada y servicios de desarrollo de software de alta calidad."
      ]
    },
    {
      "tag": "servicios",
      "patterns": [
        "que servicios ofrece",
        "que productos ofrece",
        "que hace system for all",
        "que hace la empresa",
        "que ofrece system for all",
        "que ofrece la empresa",
        "catalogo",
        "a que se dedica la empresa"
      ],
      "responses": [
        "System For All se especializa en una variedad de servicios, desde Desarrollo Web y Móvil hasta Diseño Web, Pentesting, Testing de Aplicaciones y DevOps. Nuestro objetivo es ofrecer soluciones integrales que impulsen el crecimiento y el rendimiento de tu negocio."
      ]
    },
    {
      "tag": "contacto",
      "patterns": [
        "como me contacto",
        "como me comunico",
        "quiero enviar un mensaje",
        "quiero contratar"
      ],
      "responses": [
        "¡Genial! Puedes contactarnos enviando un correo a ramirez.ricky2021@gmail.com. Estamos ansiosos por escucharte y discutir cómo podemos contribuir al éxito de tu proyecto."
      ]
    },
    {
      "tag": "team",
      "patterns": [
        "quienes conforman la empresa",
        "quienes conforman system for all",
        "cual es el equipo de la empresa",
        "cual es el equipo de system for all"
      ],
      "responses": [
        "El equipo de System For All está formado por expertos apasionados, incluyendo a Ramirez Pineda Ricky Roy y Flores Sarmiento Kevin Jhoel. Nos dedicamos a ofrecer soluciones tecnológicas excepcionales y personalizadas para nuestros clientes."
      ]
    },
    {
      "tag": "ubicacion",
      "patterns": [
        "donde se encuentra la empresa",
        "ubicacion de system for all",
        "direccion de system for all",
        "direccion de la empresa"
      ],
      "responses": [
        "Nuestra sede principal está ubicada en Bolivia. Sin embargo, operamos de manera global y estamos siempre conectados para servir a nuestros clientes en cualquier parte del mundo."
      ]
    },
    {
      "tag": "clientes",
      "patterns": [
        "quienes son los clientes",
        "empresas que han trabajado con ustedes",
        "testimonios de clientes"
      ],
      "responses": [
        "Hemos tenido el privilegio de trabajar con una variedad de clientes, desde startups hasta grandes empresas. Nuestro enfoque en la satisfacción del cliente ha llevado a relaciones comerciales exitosas y testimonios positivos."
      ]
    },
    {
      "tag": "tecnologias",
      "patterns": [
        "que tecnologias utilizan",
        "tecnologias de system for all",
        "frameworks que usan",
        "lenguajes de programacion que utilizan"
      ],
      "responses": [
        "En System For All, utilizamos las últimas tecnologías y frameworks en el desarrollo de software. Algunas de nuestras herramientas clave incluyen Laravel, Express.js, React.js, Vue.js, FastAPI, Flask, Docker y GraphQL. Además, aprovechamos servicios en la nube como AWS y Digital Ocean para garantizar soluciones eficientes y de vanguardia. También integramos pasarelas de pago como Stripe y Pagofacil para brindar una experiencia completa a nuestros clientes."
      ]
    },
    {
      "tag": "carrera",
      "patterns": [
        "como unirme al equipo",
        "oportunidades laborales",
        "vacantes disponibles",
        "proceso de contratacion"
      ],
      "responses": [
        "Nos encanta recibir nuevos talentos en nuestro equipo. Para conocer nuestras oportunidades laborales actuales y el proceso de contratación, visita nuestra sección de Carreras en nuestro sitio web o envíanos tu currículum a ramirez.ricky2021@gmail.com."
      ]
    },
    {
      "tag": "seguridad_privacidad",
      "patterns": [
        "como manejan la seguridad de datos",
        "politicas de privacidad",
        "seguridad de la informacion"
      ],
      "responses": [
        "La seguridad de los datos es una prioridad para nosotros. Implementamos medidas robustas para proteger la información de nuestros clientes. Puedes revisar nuestras políticas de privacidad en nuestro sitio web para obtener más detalles."
      ]
    },
    {
      "tag": "planes_desarrollo",
      "patterns": [
        "futuros planes de desarrollo",
        "nuevas características",
        "servicios futuros"
      ],
      "responses": [
        "Estamos constantemente evolucionando para satisfacer las crecientes necesidades del mercado. En el futuro, planeamos introducir nuevas características y servicios emocionantes. Mantente informado visitando nuestra sección de noticias o siguiéndonos en nuestras redes sociales para conocer las últimas actualizaciones."
      ]
    }
  ]
}
